Repository: oxygenxml/blog
Catalog: translations/xliff/2nd translation/translated/oxygen_xml_blog_ro.ditamap.tmx
Source language: en
Languages: ro

source: Discover how AI-powered actions in Oxygen XML Editor revolutionize XML schema and XSLT stylesheet development. With AI actions to explain, annotate, generate, or document code, chat with the AI about certain code, and to suggest refactoring, these tools help developers work faster and smarter. As XML workflows become more complex, smarter tools are essential for editing, collaboration, and refactoring. The AI Positron Assistant in Oxygen XML Editor empowers users with a suite of intelligent actions designed for modern code development.
ro: Descoperiți cum acțiunile alimentate de AI din Oxygen XML Editor revoluționează dezvoltarea de scheme XML și foi de stil XSLT. Cu acțiuni AI pentru a explica, adnota, genera sau documenta codul, pentru a discuta cu AI-ul despre anumite fragmente de cod și pentru a sugera refactorizări, aceste instrumente ajută dezvoltatorii să lucreze mai rapid și mai eficient. Pe măsură ce fluxurile de lucru XML devin mai complexe, instrumentele inteligente devin esențiale pentru editare, colaborare și refactorizare. AI Positron Assistant din Oxygen XML Editor oferă utilizatorilor o suită de acțiuni inteligente concepute pentru dezvoltarea modernă a codului.

source: In this post, we’ll explore the main AI actions that act on XML-development languages, such as XML Schema, XSLT, and Schematron — Explain Code , Chat About Code , Document Code , Annotate Code , Generate Code , and Suggest Refactoring , and we'll show examples of how they boost productivity when working with XSLT.
ro: În acest articol, vom explora principalele acțiuni AI care acționează asupra limbajelor de dezvoltare XML, precum XML Schema, XSLT și Schematron — Explain Code , Chat About Code , Document Code , Annotate Code , Generate Code și Suggest Refactoring , și vom prezenta exemple despre cum acestea cresc productivitatea la lucrul cu XSLT.

source: Watch the video demonstration: Using AI for XML Development in Oxygen XML Editor
ro: Urmăriți demonstrația video: Utilizarea AI pentru dezvoltare XML în Oxygen XML Editor

source: AI-Powered Code Actions Overview
ro: Prezentare generală a acțiunilor de cod bazate pe AI

source: AI Positron integrates smoothly with Oxygen XML Editor/Developer to improve code quality, enhance understanding, and automate repetitive development tasks. Here’s an overview of the main capabilities and their practical benefits for each AI-assisted development action:
ro: AI Positron se integrează perfect cu Oxygen XML Editor/Developer pentru a îmbunătăți calitatea codului, a facilita înțelegerea și a automatiza sarcinile repetitive de dezvoltare. Iată o prezentare a principalelor capabilități și a beneficiilor practice pentru fiecare acțiune de dezvoltare asistată de AI:

source: Select any code fragment or place your cursor inside an element and AI Positron will immediately generate an explanation. This helps you quickly understand legacy XSLT templates, Schematron rules, or complex schema definitions, reducing time spent deciphering unfamiliar code.
ro: Selectați orice fragment de cod sau plasați cursorul într-un element, iar AI Positron va genera imediat o explicație. Acest lucru vă ajută să înțelegeți rapid șabloane XSLT vechi, reguli Schematron sau definiții complexe de schemă, reducând timpul petrecut pentru a descifra cod necunoscut.

source: Start an interactive chat with the AI about the selected code. Ask questions like "What’s the purpose of this constraint?" or "How can I optimize this template?" to brainstorm improvements, resolve technical issues, and make informed changes faster.
ro: Porniți o conversație interactivă cu AI-ul despre codul selectat. Puneți întrebări precum „Care este scopul acestei constrângeri?” sau „Cum pot optimiza acest șablon?” pentru a genera idei de îmbunătățire, a rezolva probleme tehnice și a face modificări informate mai rapid.

source: With a single action, generate clear and concise XML comments for selected XSLT, XML Schema, or Schematron code. These summaries, added before the code block make onboarding, code reviews, and future maintenance easier.
ro: Cu o singură acțiune, generați comentarii XML clare și concise pentru codul XSLT, XML Schema sau Schematron selectat. Aceste rezumate, adăugate înaintea blocului de cod, facilitează onboarding-ul, reviziile de cod și mentenanța ulterioară.

source: Automatically add comments to entire documents or specific elements. The generated annotations clarify intent, constraints, and relationships, streamlining documentation and sharing knowledgeacross your team.
ro: Adăugați automat comentarii la documente întregi sau la elemente specifice. Anotările generate clarifică intenția, constrângerile și relațiile, simplificând documentarea și partajarea cunoștințelor în echipă.

source: Describe the code or transformation you need and let AI Positron create XSLT templates, Schematron assertions, XSD complex types, or JSON Schema objects. The AI reuses existing components where possible, supporting DRY (don't repeat yourself) principles and speeds up the development process.
ro: Descrieți codul sau transformarea de care aveți nevoie și lăsați AI Positron să creeze șabloane XSLT, aserțiuni Schematron, tipuri complexe XSD sau obiecte JSON Schema. AI-ul reutilizează componente existente acolo unde este posibil, respectând principiile DRY (don't repeat yourself) și accelerează procesul de dezvoltare.

source: Receive suggestions to simplify code and improve modularity.The AI can upgrade the XSLT version, split large templates, extract reusable code, or add clarifying comments. Refactoring helps you modernize and maintain code with less effort.
ro: Primiți sugestii pentru simplificarea codului și îmbunătățirea modularității. AI-ul poate actualiza versiunea XSLT, poate împărți șabloane mari, extrage cod reutilizabil sau adăuga comentarii explicative. Refactorizarea vă ajută să modernizați și să mențineți codul cu mai puțin efort.

source: Practical Example: Accelerate XSLT Development with AI Actions
ro: Exemplu practic: accelerați dezvoltarea XSLT cu acțiuni AI

source: As an XSLT developer, you can significantly speed up your workflow and improve code quality using the AI Positron add-on in Oxygen XML Editor. Here’s an example showing how to use AI actions with real XSLT code:
ro: Ca dezvoltator XSLT, vă puteți accelera semnificativ fluxul de lucru și îmbunătăți calitatea codului folosind suplimentul AI Positron în Oxygen XML Editor. Iată un exemplu care arată cum să utilizați acțiunile AI cu cod XSLT real:

source: Understand Existing Templates with Explain Code - Suppose you encounter the following template:
ro: Înțelegeți șabloanele existente cu Explain Code - Să presupunem că întâlniți următorul șablon:

source: Select this code and use the Explain Code action. The AI will output:
ro: Selectați acest cod și folosiți acțiunea Explain Code . AI-ul va genera următoarea explicație:

source: This template matches <section> elements, creates a <div> with class "section", outputs the section title in an , and applies templates to all <para> children.
ro: Acest șablon se potrivește elementelor <section> , creează un <div> cu clasa "section", afișează titlul secțiunii într-un și aplică șabloane tuturor copiilor <para> .

source: Discuss and Improve Code with Chat About Code - If you want to optimize or extend the previous template, select it and use the Chat About Code action. For example, you might ask:
ro: Discuții și îmbunătățiri cu Chat About Code - Dacă doriți să optimizați sau să extindeți șablonul anterior, selectați-l și folosiți acțiunea Chat About Code . De exemplu, puteți întreba:

source: How can I add a check to display a warning if the section has no title?
ro: Cum pot adăuga o verificare pentru a afișa un avertisment dacă secțiunea nu are titlu?

source: The AI suggested:
ro: AI-ul a sugerat:

source: Document Templates with Document Code - To help with future maintenance, select the previous updated template and use the Document Code action. The AI will insert a comment before the template:
ro: Documentați șabloanele cu Document Code - Pentru a facilita mentenanța viitoare, selectați șablonul actualizat anterior și folosiți acțiunea Document Code . AI-ul va insera un comentariu înaintea șablonului:

source: <!-- Outputs each section as a div with its title in an h2 header. Issues a warning placeholder when the title is missing and continues processing paragraphs. --> <xsl:template match="section"> [...] </xsl:template>
ro: <!-- Afișează fiecare secțiune ca un div cu titlul în antetul h2. Inserează un placeholder de avertisment când lipsește titlul și continuă procesarea paragrafelor. --> <xsl:template match="section"> [...] </xsl:template>

source: Annotate Intricate Logic with Annotate Code - For complex templates, use the Annotate Code action to insert both template documentation and inline comments, all comments in this example were generated by AI:
ro: Anotați logica complexă cu Annotate Code - Pentru șabloane complexe, folosiți acțiunea Annotate Code pentru a insera atât documentație pentru șablon, cât și comentarii inline; toate comentariile din acest exemplu au fost generate de AI:

source: <!-- Template that matches the "book" element in the input XML and transforms it into HTML. The structure includes a main <div> containing the book's title and all chapters with their sections. --> <xsl:template match="book"> <div> <!-- Output the book's title inside an tag --> <xsl:value-of select="title"/> <!-- Iterate over each "chapter" child element of "book" --> <xsl:for-each select="chapter"> <!-- Output the chapter's title inside an tag --> <xsl:value-of select="title"/> <!-- Apply templates to all "section" elements within the current chapter. This allows further processing of sections by other templates. --> <xsl:apply-templates select="section"/> </xsl:for-each> </div> </xsl:template>
ro: <!-- Șablon care se potrivește elementului "book" din XML-ul de intrare și îl transformă în HTML. Structura include un <div> principal care conține titlul cărții și toate capitolele cu secțiunile lor. --> <xsl:template match="book"> <div> <!-- Afișează titlul cărții într-un tag --> <xsl:value-of select="title"/> <!-- Iterează peste fiecare element "chapter" copil al "book" --> <xsl:for-each select="chapter"> <!-- Afișează titlul capitolului într-un tag --> <xsl:value-of select="title"/> <!-- Aplică șabloane tuturor elementelor "section" din capitolul curent. Acest lucru permite procesarea suplimentară a secțiunilor de către alte șabloane. --> <xsl:apply-templates select="section"/> </xsl:for-each> </div> </xsl:template>

source: Generate New Templates with Generate Code - Place your cursor after a comment that describes the desired functionality and use the Generate Code action:
ro: Generați șabloane noi cu Generate Code - Plasați cursorul după un comentariu care descrie funcționalitatea dorită și folosiți acțiunea Generate Code :

source: <!-- Generate a template that outputs all author names in a comma-separated list -->
ro: <!-- Generați un șablon care afișează toate numele autorilor într-o listă separată prin virgulă -->

source: The AI generates:
ro: AI-ul generează:

source: Refactor Complex Code with Suggest Refactoring - If you have a monolithic template such as:
ro: Refactorizați codul complex cu Suggest Refactoring - Dacă aveți un șablon monolitic precum:

source: This template processes the entire book structure in a single, nested template using <xsl:for-each> for chapters and <xsl:apply-templates> for sections. While this works, it can become difficult to maintain, extend, or debug as the complexity of the XML structure grows.
ro: Acest șablon procesează întreaga structură a cărții într-un singur șablon imbricat, folosind <xsl:for-each> pentru capitole și <xsl:apply-templates> pentru secțiuni. Deși funcționează, poate deveni dificil de întreținut, extins sau depanat pe măsură ce structura XML devine mai complexă.

source: Use the Suggest Refactoring action and the AI will suggest to break it into smaller templates:
ro: Rulați acțiunea Suggest Refactoring , iar AI-ul va sugera împărțirea în șabloane mai mici:

source: <xsl:template match="book"> <div> <xsl:value-of select="title"/> <xsl:apply-templates select="chapter"/> </div> </xsl:template> <xsl:template match="chapter"> <xsl:value-of select="title"/> <xsl:apply-templates select="section"/> </xsl:template> <xsl:template match="section"> <xsl:value-of select="title"/> <!-- Add more processing for section content here if needed --> </xsl:template>
ro: <xsl:template match="book"> <div> <xsl:value-of select="title"/> <xsl:apply-templates select="chapter"/> </div> </xsl:template> <xsl:template match="chapter"> <xsl:value-of select="title"/> <xsl:apply-templates select="section"/> </xsl:template> <xsl:template match="section"> <xsl:value-of select="title"/> <!-- Adăugați aici procesarea suplimentară pentru conținutul secțiunii, dacă este necesar --> </xsl:template>

source: By breaking the logic into separate templates for <book>, <chapter>, and <section>, each template is focused on a single responsibility. This modular approach makes it easier to understand what each part of the code is doing, and to locate or update specific logic.
ro: Prin împărțirea logicii în șabloane separate pentru <book>, <chapter> și <section>, fiecare șablon se concentrează pe o singură responsabilitate. Această abordare modulară face mai ușor de înțeles ce face fiecare parte a codului și de localizat sau actualizat logica specifică.

source: Summary: With these AI-powered actions, you can quickly understand, document, generate, refactor, and annotate XSLT code, making your XSLT development process faster and your stylesheets easier to maintain. For more hands-on examples, see the AI Positron Assistant samples on GitHub .
ro: Rezumat: Cu aceste acțiuni bazate pe AI, puteți înțelege rapid, documenta, genera, refactoriza și anota codul XSLT, făcând procesul de dezvoltare XSLT mai rapid și foile de stil mai ușor de întreținut. Pentru mai multe exemple practice, consultați exemplele AI Positron Assistant pe GitHub .

source: Creating a Custom AI Action
ro: Crearea unei acțiuni AI personalizate

source: For advanced automation and customized workflows, Oxygen lets you build and integrate custom AI actions directly into your workspace. These actions extend Oxygen’s standard tools and give you greater flexibility and control over AI-driven tasks.
ro: Pentru automatizări avansate și fluxuri de lucru personalizate, Oxygen vă permite să construiți și să integrați acțiuni AI personalizate direct în spațiul dvs. de lucru. Aceste acțiuni extind instrumentele standard Oxygen și vă oferă flexibilitate și control sporit asupra sarcinilor bazate pe AI.

source: Use the New Document wizard to create an AI Positron Custom Action file. This file contains an action definition in JSON format, where you can specify the action's intent, parameters, and AI logic.
ro: Folosiți expertul New Document pentru a crea un fișier AI Positron Custom Action . Acest fișier conține o definiție de acțiune în format JSON, unde puteți specifica scopul acțiunii, parametrii și logica AI.

source: Oxygen offers automatic validation and content completion for these files, so you can edit and maintain them with confidence. Work in text mode for exact control, or switch to the Author visual editing mode for a guided, interactive experience.
ro: Oxygen oferă validare automată și completare de conținut pentru aceste fișiere, astfel încât să le puteți edita și menține cu încredere. Lucrați în mod text pentru control exact sau comutați în modul vizual Author pentru o experiență ghidată și interactivă.

source: For example, you can create an AI action that generates a new XSLT document from specific content with a simple guided workflow. You define the action logic and workflow in JSON, and the integrated AI produces a complete XSLT stylesheet based on your instructions.
ro: De exemplu, puteți crea o acțiune AI care generează un document XSLT nou dintr-un anumit conținut, printr-un flux de lucru ghidat. Definiți logica și fluxul acțiunii în JSON, iar AI-ul integrat produce o foaie de stil XSLT completă pe baza instrucțiunilor dvs.

source: The following JSON shows a custom AI action that generates an XSLT 3.0 document based on provided source content:
ro: Următorul JSON prezintă o acțiune AI personalizată care generează un document XSLT 3.0 pe baza conținutului furnizat:

source: In Author mode , this action appears as a structured form, allowing you to configure and review the action visually:
ro: În modul Author , această acțiune apare ca un formular structurat, permițând configurarea și revizuirea vizuală a acțiunii:

source: Custom AI Action in Author Mode
ro: Acțiune AI personalizată în modul Author

source: [ The Create New XSLT action displayed in Author mode, with editable fields and advanced AI parameters. ]
ro: [ Acțiunea Create New XSLT afișată în modul Author, cu câmpuri editabile și parametri AI avansați. ]

source: In this setup, you supply context, objectives, the desired output action, and any helper functions (such as extracting content from a document URL). The AI then generates the XSLT file and returns only the requested code.
ro: În această configurație, furnizați context, obiective, acțiunea de ieșire dorită și orice funcții ajutătoare (cum ar fi extragerea conținutului dintr-un URL de document). AI-ul generează apoi fișierul XSLT și returnează doar codul solicitat.

source: For a detailed walkthrough on creating and customizing AI actions in Oxygen, see the official documentation: Creating Custom AI Actions in Oxygen .
ro: Pentru un ghid detaliat despre crearea și personalizarea acțiunilor AI în Oxygen, consultați documentația oficială: Creating Custom AI Actions in Oxygen .

source: Video Tutorial: How to Create Custom AI Actions in Oxygen
ro: Tutorial video: Cum să creați acțiuni AI personalizate în Oxygen

source: Tips and Best Practices
ro: Sfaturi și bune practici

source: Focused Selection: Select small code blocks for targeted explanations and documentation.
ro: Selecție focalizată: Selectați blocuri mici de cod pentru explicații și documentare țintite.

source: Iterative Chat: Use the Chat About Code action for ongoing improvements, to ask questions, make changes, and regenerate code snippets interactively.
ro: Chat iterativ: Folosiți acțiunea Chat About Code pentru îmbunătățiri continue, pentru a pune întrebări, a face modificări și a regenera fragmente de cod interactiv.

source: Refactor Files: Run the Suggest Refactoring action on your code to update it to modern standards and to create more readable, reusable modules.
ro: Refactorizați fișierele: Rulați acțiunea Suggest Refactoring pe codul dvs. pentru a-l aduce la standarde moderne și pentru a crea module mai lizibile și reutilizabile.

source: Comprehensive Comments: Annotate large, multi-template XSLT or XSD files to improve shared understanding and make onboarding easier.
ro: Comentarii cuprinzătoare: Anotați fișiere XSLT sau XSD mari, cu mai multe șabloane, pentru a îmbunătăți înțelegerea comună și a facilita onboarding-ul.

source: Explore Samples: Review and adapt provided samples to help your team get started quickly.
ro: Explorați exemplele: Examinați și adaptați exemplele furnizate pentru a ajuta echipa să înceapă rapid.

source: Conclusion
ro: Concluzie

source: AI-driven actions in Oxygen XML Editor are changing how developers approach code understanding, editing, and maintenance. Whether you’re explaining a Schematron rule, documenting a schema, generating new validation logic, or refactoring for the future, AI Positron delivers efficiency at every step. Take advantage of these tools to elevate your XML development workflow.
ro: Acțiunile bazate pe AI din Oxygen XML Editor schimbă modul în care dezvoltatorii abordează înțelegerea, editarea și mentenanța codului. Fie că explicați o regulă Schematron, documentați o schemă, generați logică nouă de validare sau refactorizați pentru viitor, AI Positron oferă eficiență la fiecare pas. Profitați de aceste instrumente pentru a vă îmbunătăți fluxul de lucru în dezvoltarea XML.

source: To experiment and learn more, check out the Code Development subfolder in the AI Positron samples project.
ro: Pentru a experimenta și a afla mai multe, consultați subfolderul Code Development din proiectul de exemple AI Positron.

source: The Oxygen AI Positron add-on provides support for helping technical documentation writers generate , re-write content, overview and research . It also supports performing AI checks and AI-based modifications on multiple files by integrating AI extensions with XML technologies like Schematron or XSLT .
ro: Suplimentul Oxygen AI Positron oferă suport pentru a ajuta creatorii de documentație tehnică să genereze , să rescrie conținut, să realizeze prezentări generale și cercetare . De asemenea, permite efectuarea de verificări AI și modificări bazate pe AI asupra mai multor fișiere prin integrarea extensiilor AI cu tehnologii XML precum Schematron sau XSLT .

source: artificial intelligence
ro: inteligență artificială

source: This article is intended to be a general overview of the Oxygen AI Positron add-on installation, licensing, and functionality.
ro: Acest articol își propune să ofere o prezentare generală a instalării, licențierii și funcționalității suplimentului Oxygen AI Positron .

source: We've envisioned this add-on as a way to offer you a personal assistant that contains useful actions for checking content (readability, grammar), translating, explaining, and creating overviews.
ro: Am conceput acest supliment ca pe o modalitate de a vă oferi un asistent personal care conține acțiuni utile pentru verificarea conținutului (lizibilitate, gramatică), traducere, explicare și crearea de prezentări generale.

source: Installation and Licensing Overview
ro: Prezentare generală a instalării și licențierii

source: Oxygen desktop allows installing the commercial AI Positron add-on . There are two main ways to connect and work with LLM models:
ro: Oxygen desktop permite instalarea suplimentului comercial AI Positron . Există două modalități principale de a vă conecta și de a lucra cu modele LLM:

source: A subscription-based model using the Oxygen Positron Service platform, which in turn allows you access to the OpenAI , Claude or Google Gemini LLMs.
ro: Un model bazat pe abonament, folosind platforma Oxygen Positron Service , care vă permite accesul la LLM-urile OpenAI , Claude sau Google Gemini .

source: Users can create new subscription accounts or authenticate using their existing Google or Github accounts. The first subscription month is free and a monthly subscription can be purchased to receive a number of credits each month.
ro: Utilizatorii pot crea conturi noi de abonament sau se pot autentifica folosind conturile existente Google sau Github . Prima lună de abonament este gratuită, iar un abonament lunar poate fi achiziționat pentru a primi un anumit număr de credite în fiecare lună.

source: You can control which AI engine is used by default for performing actions and for chatting. This can be done from the Preferences page or from the chat view.
ro: Puteți controla ce motor AI este folosit implicit pentru acțiuni și pentru chat. Acest lucru se poate face din pagina de Preferințe sau din vizualizarea de chat.

source: Connect to your own own AI engine server. The following connection types are supported:
ro: Conectați-vă la propriul server AI. Sunt acceptate următoarele tipuri de conexiuni:
